{
    "header":{
        "home": "Inicio",
        "about": "Sobre mi",
        "works": "Trabajos",
        "experience": "Experiencia"
    },
    "about": {
        "title": "Acerca de",
        "intro": "Hola, soy Jorge Sandi",
        "description": "Ingeniero de software  en San José, Costa Rica. Amo el mundo tecnológico, especialmente el desarrollo frontend. Mi pasión es crear experiencias digitales atractivas y funcionales."
    },
    "works": {
        "title": "Trabajos",
        "1": {
            "title": "Style Dealer",
            "description": "Una tienda web interactiva y con capacidad de respuesta centrada en ofrecer una experiencia de usuario fluida. La plataforma permite a los usuarios examinar productos, añadir artículos al carrito de la compra y navegar por diferentes categorías, aunque no incluye gestión de inventario ni procesamiento de pagos.",
            "codeDescription": "El proyecto de tienda web se desarrolló utilizando React con Vite para optimizar el rendimiento y los tiempos de carga. Se aplicó Tailwind CSS para conseguir un estilo atractivo y con capacidad de respuesta. Se desplegó en Vercel, lo que permitió actualizaciones automáticas y un flujo de trabajo eficiente.",
            "apiInfo": "Se desarrolló una API Node.js y Express para gestionar los datos de los usuarios mediante MongoDB. Permite operaciones CRUD (crear, leer, actualizar, eliminar) a través de rutas RESTful y utiliza Mongoose para el modelado de datos, junto con middleware para gestionar peticiones y CORS.",
            "github": "Consulta el código fuente en"
        },
        "2": {
            "title": "Gastos",
            "description": "Una aplicación móvil diseñada para simplificar la división de gastos del hogar o entre amigos. Los usuarios pueden agregar gastos, asignar montos a diferentes participantes y llevar un seguimiento de quién debe qué a quién. La app incluye funcionalidades para la gestión de grupos y la visualización de balances individuales.",
            "codeDescription": "El proyecto de la aplicación móvil se desarrolló utilizando React Native, lo que permite la compatibilidad tanto con dispositivos iOS como Android. Se implementó un diseño intuitivo y responsivo con Styled Components, asegurando una experiencia de usuario coherente y atractiva.",
            "apiInfo": "La aplicación utiliza una API desarrollada en Node.js con Express para gestionar las operaciones de gastos. La base de datos de Firebase almacena los datos de usuarios, grupos y transacciones, permitiendo operaciones en tiempo real. Se utiliza Firebase Authentication para la gestión segura de usuarios y Firestore para el almacenamiento de datos.",
            "github": "Consulta el código fuente en"
        },
        "3": {
            "title": "Web Scrapper",
            "description": "Este proyecto automatiza la recogida de datos de partidos de fútbol desde una página web, recopilando información sobre equipos, resultados y competiciones, y guardando los datos en un archivo para su posterior análisis.",
            "codeDescription": "Este proyecto utiliza Selenium y Scrapy para automatizar la extracción de datos de partidos de fútbol de una página web. Selenium se encarga de la navegación y la interacción con elementos dinámicos, mientras que Scrapy facilita la recopilación de datos. La información, incluyendo equipos, resultados y competiciones, se organiza y exporta a un archivo Excel con OpenPyXL, y el script se asegura de que el navegador se cierra al final del proceso.",
            "apiInfo": "",
            "github": "Consulta el código fuente en"
        },
        "4": {
            "title": "Ricodelik Portfolio",
            "description": "Este proyecto fue creado para un amigo mío, quien es DJ, y tiene como objetivo mostrar su carrera profesional a través de sus presentaciones, sets musicales y eventos. La página permite explorar su estilo, escuchar sus mezclas y mantenerse informado sobre sus próximos shows.",
            "codeDescription": "Este proyecto, desarrollado con React y React-Three, combina el desarrollo web interactivo con modelado 3D para crear una experiencia de usuario atractiva. React gestiona la interfaz dinámica, mientras que React-Three da vida a un modelo 3D, permitiendo elementos visuales inmersivos e interactivos. El código integra ambas tecnologías de manera eficiente para presentar un sitio web de portafolio visualmente atractivo, responsivo e interactivo.",
            "apiInfo": "",
            "github": "Consulta el codigo fuente en"
        }
    },
    "typeCode":{
        "1": "Aplicacion Movil",
        "2": "Aplicacion Web",
        "3": "Api"
    },
    "experience": {
        "title": "Experiencia",
        "1": {
            "date": "Ene 2022 - Ene 2023",
            "title": "Tester y Desarrollador Web",
            "description": "Desarrollo de páginas web para el control interno de la empresa. Control interno exhaustivo. Además, pruebas exhaustivas tanto manuales como automatizadas."
        },
        "2": {
            "date": "Ene 2023 - Actualidad",
            "title": "Desarrollador Móvil",
            "description": "Desarrollo de aplicaciones móviles centradas en la gestión eficiente de productos, almacenes y procesos de distribución."
        }
    }
}